#include <iostream>
using namespace std;

int main() {
    int r;
    cin >> r;
    string ones[] = {"", "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"};
    string teens[] = {"десять", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать",
                      "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать"};
    string tens[] = {"", "", "двадцать", "тридцать", "сорок", "пятьдесят",
                     "шестьдесят", "семьдесят", "восемьдесят", "девяносто"};
    string hunds[] = {"", "сто", "двести", "триста", "четыреста", "пятьсот",
                      "шестьсот", "семьсот", "восемьсот", "девятьсот"};

    string res = "";
    if (r >= 100) { res += hunds[r / 100] + " "; r %= 100; }
    if (r >= 20) { res += tens[r / 10] + " "; r %= 10; }
    else if (r >= 10) { res += teens[r - 10] + " "; r = 0; }
    if (r > 0) res += ones[r] + " ";

    if (r == 1 || (r % 10 == 1 && r % 100 != 11)) cout << res << "рубль" << endl;
    else if ((r >= 2 && r <= 4) , (r % 10 >= 2 && r % 10 <= 4 && r % 100 < 10 , r % 100 > 20))
        cout << res << "рубля" << endl;
    else cout << res << "рублей" << endl;
    return 0;
}